{
  "crt_template_000": "In a city, a virus is spreading, causing the total number of infected individuals to {grow_rate} every {rate_period} days. If it takes {completion_time} days for the entire city's population to be infected, how many days would it require for {target} of the people to become infected?",
  "crt_template_001": "A pandemic is occurring in a state where the total number of infected individuals {grow_rate}s every {rate_period} days. If it takes {completion_time} days for the entire state's population to become infected, how many days would it take for {target} of the state's population to be infected?",
  "crt_template_002": "People are escaping from war. Every {rate_period} days, the total count of refugees {grow_rate}s. If it takes {completion_time} days for the entire population to evacuate, how long would it take for {target} of the population to do so?",
  "crt_template_003": "A farmer is plowing a field. Every {rate_period} hours, the total plowed area {grow_rate}s. If it takes {completion_time} hours for the entire field to be plowed, how long would it take for {target} of the field to be plowed?",
  "crt_template_004": "The apples are dropping from an apple tree, with the total count of fallen apples {grow_rate}ing every {rate_period} days. If it requires {completion_time} days for all the apples to drop, how many days would it take for {target} the apples to fall?",
  "crt_template_005": "Fish are migrating and every {rate_period} days, the total distance they cover {grow_rate}s. If it takes the fish {completion_time} days to reach their destination, how many days would it take for them to cover {target} the distance?",
  "crt_template_006": "A tree branch is falling, and with every {rate_period} seconds, the total distance it covered {grow_rate}s. If it takes {completion_time} seconds for the branch to reach the ground, how long would it take for it to cover one {target} of the total distance?",
  "crt_template_007": "A fly is traveling from point A to point B. Every {rate_period} hours, the total distance it covered {grow_rate}s. If the fly reaches point B in {completion_time} hours, how long does it take for the fly to cover {target} of the distance?",
  "crt_template_008": "A new concrete pavement is drying. The overall area of dried concrete {grow_rate}s every {rate_period} days. If it requires {completion_time} days for the entire pavement to dry completely, how many days does it take for {target} the pavement to become dry?",
  "crt_template_009": "There is a freezer filled with food, and the total volume of the frozen food {grow_rate}s every {rate_period} hours. If it takes {completion_time} hours for all the food to become frozen, how long would it take to freeze {target} of the food?",
  "crt_template_010": "A pot of water is boiling on the stove, and with every {rate_period} hours, the overall volume of the evaporated water {grow_rate}s. If the entire pot takes {completion_time} hours to evaporate completely, how long does it take for {target} of the pot to evaporate?",
  "crt_template_011": "There is a section of mold on a bread loaf that {grow_rate}s in size every {rate_period} hours. If it takes {completion_time} hours for the mold to completely cover the bread, how much time is needed for the mold to cover {target} of the bread?",
  "crt_template_012": "A forest is engulfed in flames. Every {rate_period} days, the overall area of the scorched forest {grow_rate}s in size. If it takes {completion_time} days for the entire forest to be consumed by the fire, how many days would it take for {target} of the forest to be burnt?",
  "crt_template_013": "In a cave, there is a colony of bats with a population which {grow_rate}s every {rate_period} days. Given that it takes {completion_time} days for the entire cave to be filled with bats, how many days would it take for the cave to be {target} -filled with bats?",
  "crt_template_014": "A section of grass is expanding within a garden, with the total area it occupies {grow_rate}ing every {rate_period} days. If it requires {completion_time} days for the entire garden to be encompassed by the grass, how many days are needed for the grass to cover {target} of the garden?",
  "crt_template_015": "An investor possesses 1 bitcoin. Every {rate_period} days, their number of bitcoins {grow_rate}s. If it takes them {completion_time} days to achieve their investment target, how long would it take for them to reach {target} of that target?",
  "crt_template_016": "Fish inhabit a creek, and their population {grow_rate}s every {rate_period} weeks. If it requires {completion_time} weeks for the entire creek to become completely filled with fish, how long would it take to fill {target} of the creek with fish?",
  "crt_template_017": "A dust cloud hovers above the city, {grow_rate}ing in size every {rate_period} days. If it takes {completion_time} days for the entire city to be engulfed by the cloud, how many days does it take for the cloud to cover {target} of the city?",
  "crt_template_018": "There is a sick student in the class. Every {rate_period} days, the number of sick students {grow_rate}s. If it takes {completion_time} days for the entire class to become sick, how many days does it take for {target} of the class to become sick?",
  "crt_template_019": "A colony of bacteria is growing on yogurt, and the size of the colony {grow_rate}s every {rate_period} days. If it takes {completion_time} days for the colony to completely cover the yogurt, how many days does it take for the patch to cover {target} of the yogurt?",
  "crt_template_020": "A moss patch is expanding on a rock, {grow_rate}ing its size every {rate_period} days. It takes {completion_time} days for the moss to completely cover the rock. How many days are required for the moss to cover {target} of the rock?",
  "crt_template_021": "Beneath a tree, there is a heap of leaves that {grow_rate}s in size every {rate_period} weeks. If it takes {completion_time} weeks for the pile to attain a height of {full_num} meters, how much time is required for it to reach a height of {part_num} meters?",
  "crt_template_022": "Mushrooms are cultivated in a container, and their quantity {grow_rate}s every {rate_period} days. Given that it takes {completion_time} days for the mushrooms to fill the entire container, determine the time needed to fill {target} of the container.",
  "crt_template_023": "There is a man who raises rabbits in a barn. Every {rate_period} years, the rabbit population {grow_rate}s. If it takes {completion_time} years for the entire barn to become full of rabbits, how long does it take for the barn to be filled {target} way with rabbits?",
  "crt_template_024": "Within a forest, there is a growing patch of ramson that {grow_rate}s in size every {rate_period} weeks. If it takes {completion_time} weeks for the entire forest to be covered with ramson, how long would it take for the ramson to cover {target} of the forest?",
  "crt_template_025": "It is currently raining, causing the lake to fill up with water. The volume of water in the lake {grow_rate}s every {rate_period} days. If it takes a total of {completion_time} days for the lake to become completely filled, how many days would it take for the lake to reach {target} way to being full?",
  "crt_template_026": "Within a forest, there exists a tree that {grow_rate}s its height every {rate_period} years. If the tree attains its maximum height in {completion_time} years, determine the time it would take to achieve {target} of that maximum height.",
  "crt_template_027": "There is a flood occurring in a field. Every {rate_period} days, the size of the flood-stricken area {grow_rate}s. If it takes {completion_time} hours for the entire field to become submerged, how many hours would it take for {target} of the field to be inundated?",
  "crt_template_028": "A barrel is being filled with whiskey, and the total volume of whiskey {grow_rate}s every {rate_period} minutes. If it takes {completion_time} minutes to completely fill the barrel, how long would it take to fill {target} of it with whiskey?",
  "crt_template_029": "Programmers are in the process of developing new software and every {rate_period} months the total quantity of written code {grow_rate}s. If it requires {completion_time} months to complete the entire code, how much time is needed to write {target} of the code?",
  "crt_template_030": "A factory is busy filling bags with chocolate cookies. The total number of bags filled {grow_rate}s every {rate_period} hours. Given that it takes {completion_time} hours to fill all the bags, how much time is required to fill {target} of the bags?",
  "crt_template_031": "An orange tree is sprouting leaves. The number of leaves {grow_rate}s every {rate_period} months. Given that it takes {completion_time} months for the entire tree to be covered with leaves, how many months does it take for the tree to be {target} covered with leaves?",
  "crt_template_032": "An iceberg is forming and its surface {grow_rate}s every {rate_period} years. If the iceberg takes {completion_time} years to grow to {full_num} square miles, how many years are required for it to grow to {part_num} square miles?",
  "crt_template_033": "A woman is in the process of growing her hair. Every {rate_period} years, the length of her hair {grow_rate}s. If it takes {completion_time} years for her hair to achieve a length of {full_num} meters, how long would it take for it to reach a length of {part_num} meter?",
  "crt_template_034": "Ants are crawling on a cake, and every {rate_period} minutes, their population on the cake {grow_rate}s. If the entire cake is covered with ants in {completion_time} minutes, how long would it take for {target} of the cake to be covered with ants?",
  "crt_template_035": "In a room, there are rats whose population {grow_rate}s every {rate_period} months. If it takes {completion_time} months for the rats to completely fill the room, how long would it take for them to occupy {target} of the room?",
  "crt_template_036": "The wood is burning in a fireplace, and the temperature {grow_rate}s every {rate_period} minutes. If it takes {completion_time} minutes for the fireplace to reach a temperature of {full_num} degrees, how long does it take for the temperature to reach {part_num} degrees?",
  "crt_template_037": "In a fish tank, some algae are present. Every {rate_period} days, the quantity of algae {grow_rate}s. If it requires {completion_time} days for the entire fish tank to become filled with algae, how much time is needed for {target} of the fish tank to be filled with algae?",
  "crt_template_038": "An elderly woman regularly feeds cats. Every {rate_period} days, the number of cats she feeds {grow_rate}s. If she feeds {full_num} cats on the {completion_time} day, on which day does she feed {part_num} cats?",
  "crt_template_039": "Bamboo is growing in the garden, and its height {grow_rate}s every {rate_period} days. It takes {completion_time} days to reach a height of {full_num} meters. How long does it take for the bamboo to attain a height of {part_num} meters?",
  "crt_template_040": "A patient has been diagnosed with cancer, and the number of cancer cells {grow_rate}s every {rate_period} weeks. If it takes {completion_time} weeks for the cancer cells to reach a critical amount, how long will it take for the cells to reach {target} of that critical amount?",
  "crt_template_041": "There is a heap of fruit that is decaying. The quantity of spoiled fruit {grow_rate}s every {rate_period} days. If it requires {completion_time} days for the entire heap to decay, how much time will it take for {target} of the heap to decay?",
  "crt_template_042": "During winter, the lake is gradually freezing. Every {rate_period} days, the ice covering the lake's surface {grow_rate}s in size. If it takes {completion_time} days for the entire surface of the lake to freeze, how long does it take for {target} of the lake's surface to become frozen?",
  "crt_template_043": "During winter, snowfall is occurring, and the depth of the snow cover {grow_rate}s every {rate_period} hours. If it takes {completion_time} hours for the snow depth to reach {full_num} meters, how much time is required for it to reach a depth of {part_num} meter?",
  "crt_template_044": "Five individuals are constructing a home. Every {rate_period} weeks, the cumulative amount of bricks they place {grow_rate}s. Given that it takes them {completion_time} weeks to lay all the bricks, determine the duration required for them to lay {target} of the bricks",
  "crt_template_045": "Two painters are working on painting a house. With every {rate_period} hours that pass, the total area they've painted {grow_rate}s. If it takes {completion_time} hours to paint the entire house, how many hours would it take for them to paint {target} of the house?",
  "crt_template_046": "A grandmother is knitting a scarf for her grandson. Every {rate_period} weeks, the scarf's length {grow_rate}s. If it takes {completion_time} weeks to complete the entire scarf, how long would it take to knit {target} of the scarf?",
  "crt_template_047": "A forest is expanding on an island, with the area occupied by the trees {grow_rate}ing every {rate_period} years. If it takes {completion_time} years for the entire island to be covered with trees, how many years would it take for the forest to cover {target} of the island?",
  "crt_template_048": "A gas cylinder is experiencing a leak. Every {rate_period} days, the total quantity of leaked  gas {grow_rate}s. If it requires {completion_time} hours for the entire gas to leak out, how much time is needed for {target} of the gas to escape?",
  "crt_template_049": "People are walking into a theater and taking their seats. The number of people in the room {grow_rate}s every {rate_period} minutes. If it takes {completion_time} minutes for all of the seats to be taken, how long does it take for {target} of the seats to be taken?"
}